[GraphicalObject]
Name=quat
Path=diagtop
; RC-DLL=diaggui.dll
PosStyle=VARIABLE
WndStyle=
x= 0
y= 0
width=510
height= 220
Set0="BMP.dgquapmp|dgChangeDiagHelpIndex INSTPANEL| "
Rc-DLL=hpleo008.dll

[ToolDescriptor]
1=gototop   ,  PUSHBUTTON ,hpgbut02.dll
2=identify  ,  PUSHBUTTON ,hpgbut02.dll
3=logbook   ,  IMAGESET   ,hpgbut02.dll
4=temp      ,  IMAGESET   ,hpgbut02.dll
5=method    ,  IMAGESET   ,hpgbut02.dll
6=inletValve,  IMAGESET   ,hpgbut02.dll
7=PumpHead  ,  IMAGESET   ,hpgbut02.dll
8=damper    ,  IMAGESET   ,hpgbut02.dll
9=mcgv      ,  IMAGESET   ,hpgbut02.dll
10=outvalve ,  IMAGESET   ,hpgbut02.dll
11=turnonoff,  PUSHBUTTON ,hpgbut02.dll

[PUSHBUTTON gototop]
x=4
y=4
width=50
height=43
State=0
Enable=1
FrameThickness=1
SetIndex=0
ImageList=BMP...\..\LC\800\dggo2top|BMP...\..\LC\800\dggo2top|BMP...\..\LC\800\dggo2top
Command=dgGotoTopLevel quat
Help=機器パネルのトップレベルへの切替


[PUSHBUTTON identify]
x=445
y=182
width=58
height=25
State=0
Enable=1
FrameThickness=1
SetIndex=0
ImageList=Identify|Identify|Identify
Command=dgIdentifyModule "lpmp"
Help=クォータナリ ポンプ


[IMAGESET logbook]
x=455
y=14
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dglogbk1|BMP...\..\LC\800\dglogbk1|BMP...\..\LC\800\dglogbk1|@view.floatingmenu "DiagGuiReg[4]", "QUATlogbook"|クォータナリ ポンプ ログブック
set1= BMP...\..\LC\800\dglogbk2|BMP...\..\LC\800\dglogbk2|BMP...\..\LC\800\dglogbk2|@view.floatingmenu "DiagGuiReg[4]", "QUATlogbook"|クォータナリ ポンプ ログブック
Cursor= CUR...\..\LC\800\HAND1
Help=""


[IMAGESET temp]
x=455
y=114
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dgtemp01|BMP...\..\LC\800\dgtemp01|BMP...\..\LC\800\dgtemp01|@view.floatingmenu "DiagGuiReg[4]", "QUATtemp"|クォータナリ ポンプ温度
set1= BMP...\..\LC\800\dgtemp02|BMP...\..\LC\800\dgtemp02|BMP...\..\LC\800\dgtemp02|@view.floatingmenu "DiagGuiReg[4]", "QUATtemp"|クォータナリ ポンプ温度
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET method]
x=455
y=64
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dgmethd1|BMP...\..\LC\800\dgmethd1|BMP...\..\LC\800\dgmethd1|@view.floatingmenu "DiagGuiReg[4]", "QUATmethod"|クォータナリ ポンプ メソッド
set1= BMP...\..\LC\800\dgmethd2|BMP...\..\LC\800\dgmethd2|BMP...\..\LC\800\dgmethd2|@view.floatingmenu "DiagGuiReg[4]", "QUATmethod"|クォータナリ ポンプ メソッド
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET inletValve]
x=90
y=60
width=32
height=47
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0=   BMP.dginlet1|BMP.dginlet1|BMP.dginlet1|@view.floatingmenu "DiagGuiReg[4]", "QUATinletValve"|アクティブ インレット バルブ
set1=   BMP.dginlet2|BMP.dginlet2|BMP.dginlet2|@view.floatingmenu "DiagGuiReg[4]", "QUATinletValve"|アクティブ インレット バルブ
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET PumpHead]
x=131
y=64
width=137
height=149
State=0
FrameThickness=0
SetIndex=0
set0=   BMP.dgppump1|BMP.dgppump1|BMP.dgppump1|@view.floatingmenu "DiagGuiReg[4]", "QUATPumpHead"|ポンプ ヘッド アセンブリ
set1=   BMP.dgppump2|BMP.dgppump2|BMP.dgppump2|@view.floatingmenu "DiagGuiReg[4]", "QUATPumpHead"|ポンプ ヘッド アセンブリ
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET damper]
x=155
y=4
width=66
height=43
State=0
FrameThickness=0
SetIndex=0
set0=   BMP.dgdampr1|BMP.dgdampr1|BMP.dgdampr1|@view.floatingmenu "DiagGuiReg[4]", "QUATdamper"|高圧ダンパ
set1=   BMP.dgdampr2|BMP.dgdampr2|BMP.dgdampr2|@view.floatingmenu "DiagGuiReg[4]", "QUATdamper"|高圧ダンパ
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET mcgv]
x=35
y=102
width=41
height=41
State=0
FrameThickness=0
SetIndex=0
set0=   BMP.dgmcgv01|BMP.dgmcgv01|BMP.dgmcgv01|@view.floatingmenu "DiagGuiReg[4]", "QUATmcgv"|マルチ-チャンネル グラジエント バルブ
set1=   BMP.dgmcgv02|BMP.dgmcgv02|BMP.dgmcgv02|@view.floatingmenu "DiagGuiReg[4]", "QUATmcgv"|マルチ-チャンネル グラジエント バルブ
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET outvalve]
x=120
y=22
width=23
height=35
State=0
FrameThickness=0
SetIndex=0
set0=   BMP.dgoutva1|BMP.dgoutva1|BMP.dgoutva1|@view.floatingmenu "DiagGuiReg[4]", "QUAToutvalve"|アウトレット ボール バルブ
set1=   BMP.dgoutva2|BMP.dgoutva2|BMP.dgoutva2|@view.floatingmenu "DiagGuiReg[4]", "QUAToutvalve"|アウトレット ボール バルブ
Cursor= CUR...\..\LC\800\HAND1
Help=""

[PUSHBUTTON turnonoff]
x=425
y=10
width=15
height=15
State=0
Enable=1
FrameThickness=1
SetIndex=0
ImageList= RBMP.power|RBMP.power|RBMP.power_gray
Command=dgPumpTurnOnOrOff
Help=クリックでポンプ オンまたはオフ。
